#ifndef DRV_MIC_H
#define DRV_MIC_H

#include "platform_common.h"



//**********************************************************************
// 函数功能:  MIC初始化
// 输入参数： 无
// 返回参数：    
// 0x00    :  初始化成功
// 0xff    :  初始化失败
//**********************************************************************
uint8 Drv_Mic_Init(void);

//**********************************************************************
// 函数功能:  MIC采集启动
// 输入参数： 无
// 返回参数：    
// 0x00    :  操作成功
// 0xff    :  操作失败
//**********************************************************************
uint8 Drv_Mic_Sample(void);

//**********************************************************************
// 函数功能:  MIC采集停止
// 输入参数： 无
// 返回参数：    
// 0x00    :  操作成功
// 0xff    :  操作失败
//**********************************************************************
uint8 Drv_Mic_Stop(void);

//**********************************************************************
// 函数功能:  MIC关闭
// 输入参数： 无
// 返回参数：    
// 0x00    :  操作成功
// 0xff    :  操作失败
//**********************************************************************
uint8 Drv_Mic_Close(void);

//**********************************************************************
// 函数功能:  MIC采集数据获取
// 输入参数： 
// micBuf  :  缓存buf
// readLen :  读取的数据长度
// 返回参数：    
// 0x00    :  操作成功
// 0xff    :  操作失败
uint8 Drv_Mic_DataRead(uint32 *micBuf, uint32 readLen);

#endif

