#ifndef ANCS_UPLOAD_H
#define ANCS_UPLOAD_H

#if(ANCS_VER_TYPE  == ANCS_VER_1)
//**********************************************************************
// 函数功能: 定时发送消息详情
// 输入参数:
// 返回参数：none
// 说明:  两种方式将消息详情发送给app: 1.用循环方式将消息数据逐个发送给app
//   2.用timer隔一段时间发送消息详情数据。
//   当消息详情数据很大的时候，用循环的方式会出错，因此采用timer的方式
//**********************************************************************
extern void ancsAttr_UpLoad_Timeout(void);
#endif

//**********************************************************************
// 函数功能: 上传ancs消息数据给后台
// 输入参数：
// 返回参数：
//**********************************************************************
extern void ancsAttr_UpLoad(anccCb_t *anccCb);

//**********************************************************************
// 函数功能: ancs消息取消
// 输入参数：
// 返回参数：
//**********************************************************************
extern void ancsAttr_Cancle(attr_notif_t* pAttr);

#endif

