/**********************************************************************
**
**模块说明: mid层加速计接口
**软件版本，修改日志(时间，内容),修改人:
**   V1.0   2018.4.25  修改流程  ZSL  
**
**********************************************************************/
#include "drv_mic.h"
#include "mid_mic.h"

//**********************************************************************
// 函数功能:  MIC初始化
// 输入参数： 无
// 返回参数：    
// 0x00    :  初始化成功
// 0xff    :  初始化失败
//**********************************************************************
uint8 Mid_Mic_Init(void)
{
	Drv_Mic_Init();

	return 0;
}

//**********************************************************************
// 函数功能:  MIC采集启动
// 输入参数： 无
// 返回参数：    
// 0x00    :  操作成功
// 0xff    :  操作失败
//**********************************************************************
void Mid_Mic_Samle(void)
{
	Drv_Mic_Sample();
}

//**********************************************************************
// 函数功能:  MIC关闭
// 输入参数： 无
// 返回参数：    
// 0x00    :  操作成功
// 0xff    :  操作失败
//**********************************************************************
void Mid_Mic_Close(void)
{
	Drv_Mic_Close();
}

//**********************************************************************
// 函数功能:  MIC采集数据获取
// 输入参数： 
// micBuf  :  缓存buf
// readLen :  读取的数据长度
// 返回参数：    
// 0x00    :  操作成功
// 0xff    :  操作失败
void Mid_Mic_DataRead(uint32 *micBuf, uint32 readLen)
{
	Drv_Mic_DataRead(micBuf,readLen);
}

//**********************************************************************
// 函数功能：	MIC事件处理
// 输入参数：	msg	事件指针
// 返回参数：	0x00: 操作成功
//				0xff: 操作失败
//**********************************************************************
uint16 Mid_Mic_EventProcess(mic_event_s* msg)
{
	switch(msg->id)
	{
		case MIC_SAMPLE:
		Mid_Mic_Samle();
		break;

		case MIC_CLOSE:
		Mid_Mic_Close();
		break;

		default:break;
	}
	return 0;
}


	#if 0	// 硅麦测试，每秒调用一次
	uint32 micbuf[64];
	Mid_Mic_DataRead(micbuf, 64);
	for (int i = 0; i < 64; i++)
	{
	 RTT_DEBUG_printf(0,"%x ", micbuf[i]);
	}RTT_DEBUG_printf(0," \n");
	
	Mid_Mic_Samle();
	#endif



