#ifndef PLATFORM_FEATURE_H
#define PLATFORM_FEATURE_H

/****************************************************************************************
**                            软件功能开关
**
**此文件定义:软件功能开关，需要的功能将对应的宏设置为1，不用的功能就设置为0
**目的:可以通过一个文件来管理整个软件的功能可用与否，而不需要在某个模块.c中配置或临时用#if 0
**      /#if 1的方式
**
****************************************************************************************/

/****************************************************************************************
**
**功能 0-0: 定义机芯型号和客户名称
**       
****************************************************************************************/
//定义机芯型号
#define SMOVT_H001    1
#define SMOVT_H002    2
#define SMOVT_H003    3
#define SMOVT_H004    4

#define SMOVT_TYPE    SMOVT_H002

//定义客户名称
#define CUS_PUBLIC    0 //公版
#define CUS_LENOVO    1 //联想

#define CUS_TYPE      CUS_PUBLIC

/****************************************************************************************
**
**功能: 单元测试模块开关
**       
****************************************************************************************/
#define MODULE_TEST_ENABLE     1

/****************************************************************************************
**
**功能 0-1:定义是否带气压，宏设置为1---带气压；为0----不带气压
**
**说明: 客户名称和是否带气压，项目编号不一样
**
****************************************************************************************/
#define AIR_PRESSURE_SUPPORT          0

#if((SMOVT_TYPE == SMOVT_H002) && (CUS_TYPE == CUS_PUBLIC))
#include "H002_Public_cfg.h"
#elif((SMOVT_TYPE == SMOVT_H003) && (CUS_TYPE == CUS_PUBLIC))
#include "H003_Public_cfg.h"
#endif

/****************************************************************************************
**
**功能: 定义中断优先级
**
****************************************************************************************/
#define NVIC_WDT_PRIO        1
#define NVIC_CTIMER_PRIO     2
#define NVIC_GPIO_PRIO       3
#define NVIC_ADC_PRIO        4

/****************************************************************************************
**
**功能1: 充电芯片是否带路径管理，为0:不带路径管理，为1:带路径管理
**说明: 不带路径管理充电芯片:在充电过程中状态:充电->充满->放电->复充，在放电过程电量会下降，
**      会出现充电芯片是充满状态，但实际电量不一定是100
**
****************************************************************************************/
#define BAT_CHARGE_PATH_MANAGE        0

/****************************************************************************************
**
**功能 2:蓝牙配对--机芯显示pin码，手机输入PIN码，才正常连接
**
****************************************************************************************/
#define BLE_PASSKEY_PAIRNG_ENABLE     0

#endif

