#ifndef __SM_OS_H
#define __SM_OS_H


//**********************************************************************
// 函数功能:     获取OS Tick时钟
// 输入参数：    无
// 返回参数：    无
//**********************************************************************
extern uint32 SMOS_GetTickCount(void);

//**********************************************************************
// 函数功能: 将消息发送到消息队列尾
// 输入参数：pQueueHandle: 消息队列句柄
//           pMsg:消息指针；  u32Timeout:超时时间
// 返回参数：
//**********************************************************************
ret_type SMOS_SendBackToQueue(void *pQueueHandle,void *pMsg,uint32 u32Timeout);

#endif

