#ifndef H002_MEMORY_V2_H
#define H002_MEMORY_V2_H

/**********************************************************************
**
**模块说明: 内部flash，需与H002_Public_XXX.sct保持一致，
**          内部flash分配关系OTA功能
**软件版本，修改日志(时间，内容):
**   V1.0   2018.11.15  初版
**
**********************************************************************/

/**********************************************************************
** 蓝牙core区域: 此区域包含蓝牙BLE核心协议栈，OTA流程以及OS内核
** 该区域的升级方法:采用原厂默认的流程:
**     1.先将升级文件下载到flash某个区域
**     2.下载完成后重启，在BL中将升级数据搬到此此区域
**升级数据类型: OTA_DATA_CORE
**********************************************************************/
#define BLE_CORE_ROM_ADDR    0x0000C000
#define BLE_CORE_ROM_LEN     0x32000

/**********************************************************************
** APP和UI区域:  此区域包含UI,APP，驱动等应用程序
** 该区域的升级方法:
**     1.先重启机芯，然后进入升级app流程，即BLE_CORE域
**     2.直接将升级数据下载到此区域，直至升级成功，最后重启
**升级数据类型: OTA_DATA_APP
**********************************************************************/
#define APP_ROM_ADDR         0x0003E000
#define APP_ROM_LEN          0x64000

/**********************************************************************
** UI资源区域:  此区域包含UI资源
** 该区域的升级方法: 不升级，不修改
**********************************************************************/
#define UI_ROM_ADDR          0x000A6000
#define UI_ROM_LEN           0x1A000

/**********************************************************************
** 蓝牙core升级bin区域: 此区保存升级下载的蓝牙core bin数据
** 该区域的升级方法:  不涉及被升级
**********************************************************************/
#define BLE_CORE_ROM_OTA_ADDR    0x000C0000
#define BLE_CORE_ROM_OTA_LEN     0x3C000

/**********************************************************************
** OTA Falg区域: 保存OTA时标志信息，大小8K
**********************************************************************/
#define OTA_FLAG_ROM_ADDR        0xFC000
#define OTA_FLAG_ROM_LEN         0x02000

/**********************************************************************
** OTA pointer区域: 保存OTA时传给bootloader的信息用于BL搬升级数据,大小:8K
**********************************************************************/
#define OTA_POINTER_ROM_ADDR     0xFE000
#define OTA_POINTER_ROM_LEN      0x02000

#endif
